sskoog/ble_audio/apps/node2node/sdkconfig.defaults
# Target & Flash Configuration
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# C++ Configuration
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_COMPILER_STACK_CHECK=y

# Console Output over Onboard USB Serial JTAG (Virtual COM Port)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_INTERRUPT_BACKTRACE=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# Bluetooth Subsystem Configuration (BT 5.3/5.4 LE Broadcast & ISOC)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_53_FEATURES_SUPPORTED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_PERIODIC_ADV=y
CONFIG_BT_NIMBLE_PERIODIC_ADV_SYNC=y

# Wi-Fi & Software Radio Coexistence (BLE 5.3 + Wi-Fi 6)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_ESP_COEX_PREFERENCE_BT=y

# HTTP Server & WebSocket Support
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512


# Partition Table Configuration
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=n
CONFIG_PARTITION_TABLE_TWO_OTA=n
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ESP System Temperature Sensor
CONFIG_TEMP_SENSOR_ENABLE_DEFAULT_CONVERSION=y

# Main Task Stack Size (prevent stack overflow during BLE/GATT initialization)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Bluetooth 5.3 Isochronous Channels (BIS/BIG Auracast)
CONFIG_BT_NIMBLE_ISO=y
CONFIG_BT_NIMBLE_ISO_NON_STD_FLOW_CTRL=y
CONFIG_BT_NIMBLE_ISO_TEST=y
CONFIG_BT_NIMBLE_ISO_BIG=1
CONFIG_BT_NIMBLE_ISO_BIS=2
CONFIG_BT_NIMBLE_ISO_BIS_PER_BIG=2
CONFIG_BT_NIMBLE_ISO_CIG=1
CONFIG_BT_NIMBLE_ISO_CIS=4
CONFIG_BT_NIMBLE_ISO_CIS_PER_CIG=4
